export class ErrCodes {
    static readonly FORBID_LOGIN = 9004;
    static readonly UNUSUAL_LOGIN = 9011;
    static readonly BIND_CARD = "请先绑定银行卡";
    static readonly BIND_SSS = `请先绑定支付宝`;
    static readonly CODES: { [index: number]: string } = {
        400: "请重试~",
        402: "支付通道暂不可用",
        500: "请重试~",
        505: "亲，你的网络不稳定，暂时无法连接到服务器",
        506: "服务器访问超时",
        507: "提现次数达到上限",
        1004: "游戏暂未开放",
        1005: "服务器维护中,请稍后尝试", // 服务器关闭
        1006: "SERVER_IS_INIT",
        2002: "非法用户名",
        2003: "名字重复",
        3001: "用户名或密码错误",
        3003: "余额不足",
        3004: "余额不足",
        3005: "余额不足",
        3006: "您正在游戏中",
        3008: "提现金额不合法",
        3014: "兑换后携带金额低于10，无法提现",
        3015: `支付宝账号已经被绑定过多次`,
        3016: "银行账号已经被绑定过多次",
        3017: "密码错误",
        3009: "创建过于频繁",
        3011: "用户未绑定",
        //3014: "绑定超时",//20180430,阿贵说可以取消
        4001: "房间不存在",
        4003: "房间不存在",
        4004: "您要加入的房间已经满员",
        4005: "您已在其他房间",

        6003: "参数错误",
        6004: "余额不足",
        6005: "安全密码错误",
        6006: "不在范围",
        6007: "对方不存在",
        6008: "对方不是VIP，普通用户只能转给VIP号",
        6009: "对方不是正式账号",
        6012: "未开启",
        6013: "超过今日提现总额",
        6014: "请先绑定银行卡",
        6015: "无效的收分代理",
        6016: "操作频繁，请稍后再试",
        6017: "账号不存在",

        8001: "您已经有师父了",
        8002: "不能拜自己的徒弟为师",
        8003: "不能拜自己的徒孙为师",
        8004: "用户不存在",
        8005: "对方不是正式账号",

        9001: "获取验证码太频繁",
        9002: "获取验证码太频繁",
        9003: "验证码错误",
        9004: "由于您严重违反游戏规定，进行伙牌或者有刷号行为，伤害其他玩家利益，您的账号被永久封禁！",
        9005: "用户名或密码错误",
        9006: "此手机已被绑定",
        9007: "游戏正在维护，请等待维护完毕",
        9008: "请重新登录",
        9011: "此为非常用设备，请先使用短信验证登录",
        9012: "请再试一次",
        9013: "您所在的地区禁止登录",
        9014: "无法绑定该手机，请更换",
        
        9015: "超过连续做庄次数",
        9016: "之前的玩家退出",
        9017: "金额不足",

        10002: "账号异常，无法兑换",
        10003: "今日提现次数达到上限",

        11000: "充值金额太小",
        11001: "充值金额太大",
        11002: "充值类型错误",
        11003: "充值过于频繁",
        11004: "请重试",              // 充值通道 配置有改变
        11005: "该通道暂时关闭，请选择其他充值方式",
        13001: "充值金额不足",
        13002: "流水金额不足",
        13003: "您已获取会员码",
        13004: "会员码已发放完毕",



        15001: "协议错误",
        15002: "执行失败",
        15003: "配置错误",
        15004: "用户不存在",
        15005: "代理匹配失败",
        15006: "会话无效",
        15007: "代理离线",
        15008: "会话发起时间限制",
        15009: "会话已经结束",
        15010: "会话未结束",
        15011: "数据库重复",
        15012: "未完成订单已达到上限",
        15013: "用户不存在",
        15014: "关闭订单上限已满",
        15015: "获取未完成订单数量有误",
    }
    static getErrStr(code: number | string, preFix: string) {
        if (typeof code === "string") {
            return preFix + "," + code;
        }
        let errDesc = this.CODES[code] || `未知错误:${code}`;
        if (errDesc.length + preFix.length <= 15) {
            errDesc = preFix + "," + errDesc
        }
        return errDesc;
    }
}